MOUNTH_COUNT = 12
// количество месяцев

EMPLOYEE_AMOUNT = 256
// количество сотрудников по штатному расписанию

HOURS_IN_DAY = 24
// константа часов в сутках для перерасчета часового потребления энергии

ELECTRO_COUNTER_ERROR_% = 1
// погрешность прибора учета электроэнергии

VARIANT_NUMBER = 100
// количество вариантов повторений

STRING_LEN = len(string)
// константа длины строки для использования в нескольких циклах

NEGATIVE = -1, ZERO = 0, POSITIVE = 1
// три константы подстановки значений при выполнении условия меньше, больше или равно нулю

PI = 3,141592
// число ПИ

ELECTRO_TO_REFERENCE_FIEL = 0.3445
HEAT_TO_REFERENCE_FIEL = 0.143
NATURAL_GAS_TO_REFERENCE_FIEL = 1.154
// коэффициенты перевода натурального топлива в условное