7.1
keykey - is_odd
// четное или нечетное

result - is_found
// найдено значение или нет

revert - is_reverce_method
// переменная проведения расчета с начала или конца списка

flags - is_normal_finish
// результат нормального окончания функции

k - is_negative
// переменная меньше или больше 0


7.2
result - found
// найдено значение или нет

flags - done
// результат нормального окончания функции

k - error
// переменная меньше или больше 0


7.3
i, j - horizontal, vertical
// индексы горизонтальной и вертикальной позиции в двумерном массиве

i - day
// день недели

j - mounth
// месяц

k - symbol
// символ в строке


7.4
start, finish
// начало и конец среза строки

begin, end
// начальный и конечный индекс массива

negative, positive
// положительное или отрицательное число


7.5
i - _
//  переменная вообще не участвует в расчетах в цикле

k - current_symbol
// переменная цикла, которой присвается очередное значение символа в строке
